In [25]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({
    'name' : ['AA', 'AA', 'CC', 'DD', 'EE'],
    'age' : [10.222, 22.344, 33.44, 44.3223, 77.353],
    'gender' : [1, 23, 23, 32,21]},
    columns=['name', 'age', 'gender'])
df1.set_index('name')
usd = pd.Series(['Aa',True, False,True,False])
type(usd[0])==np.str

True

In [34]:
lidf1['name']

0    AA
1    AA
2    CC
3    DD
4    EE
Name: name, dtype: object

# del df1['name'], df1['age']
df1.drop(['name','age'],axis=1,inplace=True)
df1

In [33]:
ll = pd.Series(['XX','CC','AA','GG','EE','ss'])
df1['name'].isin(ll)

0     True
1     True
2     True
3    False
4     True
Name: name, dtype: bool

In [210]:
for i in df1['name'].loc[usd]:
    print i

AA
DD

In [26]:
df1['name'][1:len(df1['name'])].isin(ll)

NameError: name 'll' is not defined

In [158]:
df1['name'][(df1['name']=='AA') | (df1['age']==10.22)]

0    AA
Name: name, dtype: object

In [28]:
ll = ['AA','DD']
l1 = map(lambda x,y: x|y ,df1['name'][1:len(df1['name'])].isin(ll), df1['name'][:len(df1['name'])-1].isin(ll))
l1.insert(0,False)
l1

[False, True, False, True, True]

In [29]:
df1['name'] = df1['name'].map(lambda x: x.strip())
df1['name']

0    AA
1    BB
2    CC
3    DD
4    EE
Name: name, dtype: object

In [138]:
Prob = pd.Series([0]*7)
print Prob
SovVal = pd.Series([1,4,7,5])
print SovVal
SovProbs = pd.Series([0,'xx',0,0,'x','y','z','u','v'])
print SovProbs
SovIndex = pd.Series([1,1,1,0,0,1,0])
print SovIndex

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64
0    1
1    4
2    7
3    5
dtype: int64
0     0
1    xx
2     0
3     0
4     x
5     y
6     z
7     u
8     v
dtype: object
0    1
1    1
2    1
3    0
4    0
5    1
6    0
dtype: int64

In [140]:
j=0
for i in range(0,len(SovIndex)):
    if SovIndex[i]==1:
        #for j in SovVal:
        x = SovProbs.iloc[SovVal[j]]
        Prob.iloc[i] = x
        j=j+1
        
Prob

0    xx
1     x
2     u
3     0
4     0
5     y
6     0
dtype: object

In [31]:
len(df1.columns[1:])

2

In [199]:
df1.to_html()

u'<table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>name</th>\n      <th>age</th>\n      <th>gender</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>0</th>\n      <td>AA</td>\n      <td>10.22</td>\n      <td>1</td>\n    </tr>\n    <tr>\n      <th>1</th>\n      <td>BB</td>\n      <td>22.34</td>\n      <td>23</td>\n    </tr>\n    <tr>\n      <th>2</th>\n      <td>CC</td>\n      <td>33.44</td>\n      <td>23</td>\n    </tr>\n    <tr>\n      <th>3</th>\n      <td>DD</td>\n      <td>44.32</td>\n      <td>32</td>\n    </tr>\n    <tr>\n      <th>4</th>\n      <td>EE</td>\n      <td>77.35</td>\n      <td>21</td>\n    </tr>\n  </tbody>\n</table>'

In [162]:
df2 = pd.DataFrame({
    'name' : ['BB', 'AA', 'CC', 'DD'],
    'age' : ['BB', 10, 33, 44]},
    columns=['name', 'age'])

df2['color'] = "red"
df2

  name age color
0   BB  BB   red
1   AA  10   red
2   CC  33   red
3   DD  44   red

In [167]:
df2.query('color == name')

Empty DataFrame
Columns: [name, age, color]
Index: []

In [26]:
df2.loc[:,:]

  name  age color
0   BB   22   red
1   AA   10   red
2   CC   33   red
3   DD   44   red

In [211]:
df2.insert(3, 'colu', ['ok'])

ValueError: Length of values does not match length of index

In [74]:
df1.set_index(['name','age'], inplace=True)
df1

          gender
name age
AA   10        1
BB   22       23
CC   33       23
DD   44       32
EE   77       21

In [207]:
#df2.set_index(['name','age'], inplace=True)
print df2
df2.insert(2, 'cew', 'ok')

         color
name age
BB   22    red
AA   10    red
CC   33    red
DD   44    red

IndexError: index 2 is out of bounds for axis 0 with size 1

In [23]:
df = df1.join(df2, how='outer')
df.reset_index(inplace=True)
df.set_index(['name'], inplace=True)
df

NameError: name 'df2' is not defined

In [22]:
df.iloc[2]

NameError: name 'df' is not defined

In [193]:
df1

  name      age  gender
0   AA  10.2220       1
1   BB  22.3440      23
2   CC  33.4400      23
3   DD  44.3223      32
4   EE  77.3530      21

In [177]:
map(lambda x,y: x-y, df['age'], df['gender'])

[9, -1, 10, 12, 56]

In [170]:
filter(lambda x: x > 0, df.loc[df['age'] - df['gender']]>0)

KeyError: u'None of [name\nAA     9\nBB    -1\nCC    10\nDD    12\nEE    56\ndtype: int64] are in the [index]'

In [131]:
df.groupby('Group').filter(lambda x: x.loc[x.Mag.idxmin(), 'Morph'] == 'S')

TypeError: filter expected 2 arguments, got 1

In [128]:
ll = []
for i,r in df.iterrows():
    if r['age'] - r['position'] > 0:
        ll.append(pd.Series(r))
print ll

[age         22.0
gender      23.0
position     2.0
Name: BB, dtype: float64, age         44.0
gender      32.0
position    32.0
Name: DD, dtype: float64]

In [3]:
df.values

array([['AA', 10, 'F', nan],
       ['BB', 22, 'M', nan],
       ['CC', 33, 'M', nan],
       ['DD', 44, 'F', nan]], dtype=object)

In [4]:
# df.position = 'L1'
df.position = np.arange(4.)
df

  name  age gender  position
1   AA   10      F       0.0
2   BB   22      M       1.0
3   CC   33      M       2.0
4   DD   44      F       3.0

In [5]:
df.columns

Index([u'name', u'age', u'gender', u'position'], dtype='object')

In [98]:
df.gender[df.age > 20][df.gender == 'M'][df.position ==1.0]

2    M
Name: gender, dtype: object

In [15]:
df[['name','age']]

  name  age
0   AA   10
1   BB   22
2   CC   33
3   DD   44

In [8]:
df.ix[2]

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

name        BB
age         22
gender       M
position     1
Name: 2, dtype: object

In [179]:
ser1 = pd.Series([1.0,5.9,], index=[2,4])
df.position = ser1
df.index

Index([u'AA', u'BB', u'CC', u'DD', u'EE'], dtype='object', name=u'name')

In [10]:
df['NewCol'] = df.position == 1.0
df

  name  age gender  position  NewCol
1   AA   10      F       NaN   False
2   BB   22      M       1.0    True
3   CC   33      M       NaN   False
4   DD   44      F       5.9   False

In [11]:
del df['NewCol']

In [12]:
df2 = pd.DataFrame({
    'name' : {'fname' : 'sakshi', 'lname' : 'goyal'},
    'address' : {'line1' : 3, 'line2' : 4}
})
df2.T

          fname line1 line2  lname
address     NaN     3     4    NaN
name     sakshi   NaN   NaN  goyal

In [13]:
df3 = pd.DataFrame({
    'name' : df.name[0:3],
    'age' : df.age[:]
})
df3

   age name
1   10   AA
2   22   BB
3   33   CC
4   44  NaN

In [14]:
# set index and column name of dict inside dict type data frame
df2.index.name = 'name'
df2.columns.name = '<--->'
df2

<--->  address    name
name
fname      NaN  sakshi
line1      3.0     NaN
line2      4.0     NaN
lname      NaN   goyal

In [15]:
df2.values

array([[nan, 'sakshi'],
       [3.0, nan],
       [4.0, nan],
       [nan, 'goyal']], dtype=object)

In [16]:
# reindexing
df3.index.name = 'index'
df4 = df3.reindex([2, 4, 3, 8], fill_value = 0, method='ffill')
df4

       age name
index
2       22   BB
4       44  NaN
3       33   CC
8       44  NaN

In [215]:
df5 = pd.DataFrame(np.arange(16).reshape(4,4), index = ['a', 'c', 'd', 'e'], columns = ['f1', 'f2','f3','f4'])
df5.index.name = 'ind'
df5

     f1  f2  f3  f4
ind
a     0   1   2   3
c     4   5   6   7
d     8   9  10  11
e    12  13  14  15

In [216]:
df5.drop(['c'])

     f1  f2  f3  f4
ind
a     0   1   2   3
d     8   9  10  11
e    12  13  14  15

In [217]:
df5.drop(['f2'], axis=1)

     f1  f3  f4
ind
a     0   2   3
c     4   6   7
d     8  10  11
e    12  14  15

In [218]:
df5[1:3]

     f1  f2  f3  f4
ind
c     4   5   6   7
d     8   9  10  11

In [219]:
df5['a':'d']

     f1  f2  f3  f4
ind
a     0   1   2   3
c     4   5   6   7
d     8   9  10  11

In [220]:
df5[:'a']

     f1  f2  f3  f4
ind
a     0   1   2   3

In [221]:
df5['c':'d'] = 8
df5

     f1  f2  f3  f4
ind
a     0   1   2   3
c     8   8   8   8
d     8   8   8   8
e    12  13  14  15

In [222]:
df5 < 7

        f1     f2     f3     f4
ind
a     True   True   True   True
c    False  False  False  False
d    False  False  False  False
e    False  False  False  False

In [223]:
df5.ix[df5.index > 'b', 'f1']     # number of columns to want

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

ind
c     8
d     8
e    12
Name: f1, dtype: int64

In [229]:
reind = pd.Series(['a','b','c','d',1,2,3,4])
df6 = df5.reindex(reind)
df6

    f1   f2   f3   f4
a  0.0  1.0  2.0  3.0
b  NaN  NaN  NaN  NaN
c  8.0  8.0  8.0  8.0
d  8.0  8.0  8.0  8.0
1  NaN  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN

In [225]:
df6.ix[:'c', :3]

/home/sa.goyal/anaconda2/lib/python2.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

    f1   f2   f3
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  8.0  8.0  8.0

In [226]:
df6.iloc[:df6.index.get_loc('c')+1, :3]

    f1   f2   f3
a  0.0  1.0  2.0
b  NaN  NaN  NaN
c  8.0  8.0  8.0

In [227]:
df6.loc[:'c', ['f1','f2']]

    f1   f2
a  0.0  1.0
b  NaN  NaN
c  8.0  8.0

In [133]:
df5

     f1  f2  f3  f4
ind
a     0   1   2   3
c     8   8   8   8
d     8   8   8   8
e    12  13  14  15

In [134]:
df6.applymap(lambda x : x ** 2)

     f1    f2    f3    f4
a   0.0   1.0   4.0   9.0
b   NaN   NaN   NaN   NaN
c  64.0  64.0  64.0  64.0
d  64.0  64.0  64.0  64.0
1   NaN   NaN   NaN   NaN
2   NaN   NaN   NaN   NaN
3   NaN   NaN   NaN   NaN
4   NaN   NaN   NaN   NaN

In [138]:
df5.f3 = df5.f3.astype(str) + 'T'
df5

     f1  f2   f3  f4
ind
a     0   1   2T   3
c     8   8   8T   8
d     8   8   8T   8
e    12  13  14T  15

In [144]:
df5[df5.f1 == 8]

     f1  f2  f3  f4
ind
c     8   8  8T   8
d     8   8  8T   8